import { Link } from "react-router-dom";

const Course1 = () => {
  return (
    <div className="entering-container">
      <h1>DOCTYPE HTML:</h1>
      <p>
        <b>!DOCTYPE html</b> არის ინსტრუქცია ვებ ბრაუზერისთვის იმის შესახებ, თუ
        HTML-ის რომელ ვერსიაშია დაწერილი გვერდი. HTML დოკუმენტებში საჭიროა
        ბრაუზერის მითითება, თუ როგორ მოახდინოს შინაარსი.
      </p>
      <h1>html:</h1>
      <p>
        <b>html</b> ელემენტი ახვევს მთელ შიგთავსს მთელ ვებ გვერდზე. ის
        ემსახურება როგორც HTML დოკუმენტის ძირეულ ელემენტს.
      </p>
      <h1>head:</h1>
      <p>
        ელემენტი head შეიცავს მეტა-ინფორმაციას დოკუმენტის შესახებ, როგორიცაა
        მისი სათაური, სტილის ცხრილების ბმულები, სკრიპტები და სხვა მეტატეგები. ის
        არ ჩანს თავად ვებ გვერდზე.
      </p>

      <h1>meta ტეგი და charset="UTF-8":</h1>

      <p>
        meta charset="UTF-8" განსაზღვრავს სიმბოლოების დაშიფვრას HTML
        დოკუმენტისთვის, რაც უზრუნველყოფს ბრაუზერის ტექსტის სწორად
        ინტერპრეტაციას. UTF-8 არის სიმბოლოების კოდირება, რომელიც მხარს უჭერს
        სიმბოლოების ფართო სპექტრს სხვადასხვა ენიდან და სკრიპტიდან.
      </p>

      <h1>title:</h1>

      <p>
        ელემენტი title ადგენს HTML დოკუმენტის სათაურს, რომელიც გამოჩნდება
        ბრაუზერის სათაურის ზოლში ან ჩანართში. ის მნიშვნელოვანია საძიებო სისტემის
        ოპტიმიზაციისთვის (SEO) და ეხმარება მომხმარებლებს გვერდის ამოცნობაში
        სანიშნეების ან გაზიარების დროს.
      </p>

      <h1>body:</h1>

      <p>
        ელემენტი body შეიცავს HTML დოკუმენტის ძირითად შინაარსს, როგორიცაა
        ტექსტი, სურათები, ვიდეო და სხვა ელემენტები. ეს არის ვებგვერდის
        თვალსაჩინო ნაწილი, რომელთანაც მომხმარებლები ურთიერთობენ.
      </p>

      <Link to='/Html/Course2'><button>გაკვეთილი N2</button></Link>
    </div>
  );
};

export default Course1;
