const Course5 = () => {
    return ( 
        <div className="entering-container">
            <h1>Tables HTML-ში</h1>

            <p>ალბათ ყველას გაქვთ გავლილი მათემატიკაში დიაგრამები და ცხრილები სწორედ ერთერთ მსგავს გავივლით ჩვენ
                ასეთი ცხრილები გამოიყენება მონაცემების უფრო დეტალურად განაწილებისათვის აქ გვემატება შემდეგი ელემენტები
                table, tr, td და th, მოდიშ შევქმნათ ჩვეულებრივი ცხრილი.
            </p>

            {/* აქ  */}
        </div>
     );
}
 
export default Course5;