import '../CSS/mainpagecss/Whatwedo.css'
import coding from '../../assets/imageForcoding.jpg'

const WhatWeDo = () => {
    return ( 
        <div className='whatwedo-container'>
            <h3>რას გთავაზობთ ჩვენ?</h3>

            <div className="whatdoing-container">
                <p>

                გამარჯობა😀👋 ჩვენი პროექტი GeorgiaProCode გთავაზობთ მარტივ,<br />
                სახალისო და შემეცნებითი ფორმის ვებგვერდს სადაც 6 კლასი-დან დაწყებული,<br />
                10 კლასის მოსწავლეების ჩათვლით და უფრო მაღალი ასაკის მოსწავლეებსაც შეუძლიათ შეისწავლონ პროგრამირება მარტივად,<br />
                არა უბრალო და მოსაწყენი მასალებით არამედ თამაშისა და სხვადასხვა თასქების სახით, რომელიც<br />
                განავითარებს ბავშვის, როგორც ლოგიკურ ასევე მათემატიკურ და სხვა სახის თვისებებს.<br />
                ჩვენი პროგრამის მთავარი მიზანია რომ დავიცვათ ბავშვები ადიქციისაგან და ჩავრთოთ ისინი ისეთ პროგრამებში,
                სადაც შეეძლებათ თავის თავის განვითარება.
                </p>

                <img className='webimage' src={coding} alt="coding image" />
            </div>

            <h3>რა არის პროგრამირება?</h3>

            <p><b>პროგრამირება</b>მოკლედ რომ ავხსნად ის ხშირად მოიხსენიება როგორც კოდინგი🖥️ პროგრამირება არის იგივე ბრძანებებთა სისტემა, რომელიც იგზავნება მთავარ
            სერვერულ კომპიუტერებზე და თუ ის სწორად შესრულდება მივიღებთ შესაბამის პასუხს სწორედ ასე იქმენბა ვებსაიტები, თამაშები, 
            აპლიკაციები და ა.შ.<br /><br />
            <b>პროგრამისტი</b> სწორედ ის ადამიანია რომელიც წერს კოდს და ქმნსი საიტებსა თუ აპლიკაციებს პროგრამირებით დაკავებული<br />
            ადამიანი მხოლოდ შეიზღუდება თავის ფანტაზიითა და ცოდნით ამ სფეროში სწორედ ამ სფეროში შეგიძლია გააკეთო ყველაფერი<br />
            რაც შენ გსურს.</p>

            <h3>რატომ უნდა აირჩიოთ პროგრამირება?</h3>
            <p>
                პროგრამირება დღესდღეობით ერთ-ერთი ყველაზე ფართოდ გავრცელებული სფეროა რომელიც ფასდება და არის მაღალი შემოსავლის წყარო💸💸<br />
                რომელიც გაცილებით უფრო მარტივია ვიდრე სხვა.
            </p>
        </div>
     );
}
 
export default WhatWeDo;